// 角色和武器基础数据
export const standard5 = ['维里奈','卡卡罗','安可','凌阳','鉴心'];

export const fourAll = ['秧秧','丹瑾','桃祈','秋水','散华','渊武','莫特斐','白芷','炽霞','釉瑚','灯灯','卜灵'];

export const weapons = {
  '忌炎':'苍鳞千嶂','吟霖':'掣傀之手','今汐':'时和岁稔','长离':'赫奕流明','折枝':'琼枝冰绡','相里要':'诸方玄枢','守岸人':'星序协响','椿':'裁春',
  '珂莱塔':'死与舞','洛可可':'悲喜剧','菲比':'和光回唱','布兰特':'不灭航路','坎特蕾拉':'海妖低语','赞妮':'焰光裁定','夏空':'林间的咏叹调',
  '卡提希娅':'驳问之刺','露帕':'焰痕','弗洛洛':'忘川','奥古斯塔':'雷霆疆域','尤诺':'望月','嘉贝莉娜':'光与影','仇远':'秋水长天','千咲':'云雾切',
  '琳奈':'光谱','莫宁':'星野','西格莉卡':'限定武器','绯雪':'限定武器','达妮娅':'限定武器','爱弥斯':'限定武器','陆·赫斯':'限定武器','露西':'蜃影','丽贝卡':'碎骨','洛瑟菈':'存帧'
};

export const bannerNames = {
  "忌炎": "夜将寒色去",
  "吟霖": "惊霆雨时节",
  "今汐": "寒尽觉春生",
  "长离": "炽羽策阵星",
  "折枝": "赋彩作长吟",
  "相里要": "千机逐星野",
  "守岸人": "直至海水褪色",
  "椿": "徘徊迷宫尽处",
  "珂莱塔": "另一种喧嚣",
  "洛可可": "箱中舞台",
  "菲比": "于静谧呢喃",
  "布兰特": "燃焰于海",
  "坎特蕾拉": "映海之梦",
  "赞妮": "行于光影之间",
  "夏空": "诗与乐的交响",
  "卡提希娅": "却也在风潮后轻舞",
  "露帕": "胜利为我喝彩",
  "弗洛洛": "挽歌永不落幕",
  "奥古斯塔": "不坠烜冕",
  "尤诺": "漫于盈缺时轴",
  "琳奈": "非定义光谱",
  "莫宁": "纵使星光于无穷远",
  "爱弥斯": "飞星自春天启航",
  "陆·赫斯": "逾此长冬",
  "嘉贝莉娜": "于灰烬中",
  "仇远": "于灰烬中",
  "西格莉卡": "符文烁醒之刻",
  "露西": "梦行于月畔",
  "丽贝卡": "怒烬中重燃",
  "千咲": "曙暮一线之间",
  "绯雪": "雪色所映千般未来",
  "达妮娅": "予明日以谎言",
  "洛瑟菈": "显影于明日"
};

export const threeWeapons = ['训练迅刀','训练长刃','训练佩枪','训练臂铠','训练音感仪','暗夜迅刀','暗夜长刃','暗夜佩枪','暗夜臂铠','暗夜音感仪'];

export const fourWeapons = ['奇幻变奏','骇行','呼啸重音','永夜长明','异度','不归孤军','钢影拳','飞景','行进序曲','核熔星盘','华彩乐段','袍泽之固'];

export const standardWeapons = [
  {name:'千古洑流',banner:'冬烟·迅刀'},
  {name:'浩境粼光',banner:'冬烟·长刃'},
  {name:'停驻之烟',banner:'冬烟·佩枪'},
  {name:'擎渊怒涛',banner:'冬烟·臂铠'},
  {name:'漪澜浮录',banner:'冬烟·音感仪'}
];

export const newJourneyChars = ['守岸人','椿','今汐','长离','忌炎','吟霖','折枝','相里要'];